zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_sg/pic32cx_sg60/pic32cx1025sg60128-pinctrl.h
/* pd10a_eic_extint5 */
#define PD10A_EIC_EXTINT5 MCHP_PINMUX(d, 10, a, periph)

/* pd10c_sercom7_pad2 */
#define PD10C_SERCOM7_PAD2 MCHP_PINMUX(d, 10, c, periph)

/* pd10d_sercom6_pad2 */
#define PD10D_SERCOM6_PAD2 MCHP_PINMUX(d, 10, d, periph)

/* pd10f_tcc0_wo3 */
#define PD10F_TCC0_WO3 MCHP_PINMUX(d, 10, f, periph)

/* pd11_gpio */
#define PD11_GPIO MCHP_PINMUX(d, 11, gpio, gpio)

/* pd11a_eic_extint6 */
#define PD11A_EIC_EXTINT6 MCHP_PINMUX(d, 11, a, periph)

/* pd11c_sercom7_pad3 */
#define PD11C_SERCOM7_PAD3 MCHP_PINMUX(d, 11, c, periph)

/* pd11d_sercom6_pad3 */
#define PD11D_SERCOM6_PAD3 MCHP_PINMUX(d, 11, d, periph)

/* pd11f_tcc0_wo4 */
#define PD11F_TCC0_WO4 MCHP_PINMUX(d, 11, f, periph)

/* pd12_gpio */
#define PD12_GPIO MCHP_PINMUX(d, 12, gpio, gpio)

/* pd12a_eic_extint7 */
#define PD12A_EIC_EXTINT7 MCHP_PINMUX(d, 12, a, periph)

/* pd12f_tcc0_wo5 */
#define PD12F_TCC0_WO5 MCHP_PINMUX(d, 12, f, periph)

/* pd20_gpio */
#define PD20_GPIO MCHP_PINMUX(d, 20, gpio, gpio)

/* pd20a_eic_extint10 */
#define PD20A_EIC_EXTINT10 MCHP_PINMUX(d, 20, a, periph)

/* pd20c_sercom1_pad2 */
#define PD20C_SERCOM1_PAD2 MCHP_PINMUX(d, 20, c, periph)

/* pd20d_sercom3_pad2 */
#define PD20D_SERCOM3_PAD2 MCHP_PINMUX(d, 20, d, periph)

/* pd20f_tcc1_wo0 */
#define PD20F_TCC1_WO0 MCHP_PINMUX(d, 20, f, periph)

/* pd20i_sdhc1_sdcd */
#define PD20I_SDHC1_SDCD MCHP_PINMUX(d, 20, i, periph)

/* pd21_gpio */
#define PD21_GPIO MCHP_PINMUX(d, 21, gpio, gpio)

/* pd21a_eic_extint11 */
#define PD21A_EIC_EXTINT11 MCHP_PINMUX(d, 21, a, periph)

/* pd21c_sercom1_pad3 */
#define PD21C_SERCOM1_PAD3 MCHP_PINMUX(d, 21, c, periph)

/* pd21d_sercom3_pad3 */
#define PD21D_SERCOM3_PAD3 MCHP_PINMUX(d, 21, d, periph)

/* pd21f_tcc1_wo1 */
#define PD21F_TCC1_WO1 MCHP_PINMUX(d, 21, f, periph)

/* pd21i_sdhc1_sdwp */
#define PD21I_SDHC1_SDWP MCHP_PINMUX(d, 21, i, periph)

#endif /* MICROCHIP_PIC32CX1025SG60128_PINCTRL_H_ */
